testCase/bunsenFlame/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     FGMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.01;

deltaT          1e-15;

writeControl    adjustableRunTime;

writeInterval   5e-5;
//writeInterval 2e-6;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

compression     on;

timeFormat      general;

timePrecision   10;

autoWriteNow    true;

writeVolume     false;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.1;


// ************************************************************************* //
