testCase/bunsenFlame/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
   location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{

    inlet
    {
        type               calculated;
        value              $internalField;
        
    }


    outlet
    {
        type 		calculated;
        value           $internalField;
        //type            waveTransmissive;
        //value           $internalField;
        //field           p;
        //gamma           1.3;
        //phi		phi;
        //rho             rho;
        //psi             thermo:psi;        
        //fieldInf        1e5;
        //lInf            1;         
    }

    upperWall
    {
        type            symmetry;
    }

    lowerWall
    {
        type            symmetry;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
