testCase/bunsenFlame/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
        inlet
    {
      type            fixedFluxPressure;
      value           $internalField;
      //type            zeroGradient;
    }

    outlet
    {
        //type            prghPressure;
        //p               $internalField;
        //value           $internalField;
        
        type         waveTransmissive;
        value        $internalField;
        field        p;
        gamma        1.3;       
        fieldInf     1e5;
        lInf         0.1; 
      
      // type            fixedFluxPressure;
      // value           $internalField;
    }

   upperWall
    {
        type            symmetry;
    }

    lowerWall
    {
        type            symmetry;
    }

    frontAndBack
    {
        type            empty;
    }


}


// ************************************************************************* //
