testCase/bunsenFlame/0/PV
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      PV;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [ 0 0 0 0 0 0 0 ];

internalField   uniform 0.8; 

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            symmetry;
    }
    lowerWall
    {
        type            symmetry;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
