testCase/bunsenFlame/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          1e-2;
    }

    rhoFinal
    {
        $rho;
        relTol 0;
    }

    p_rgh
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-09;
        relTol           1e-2;
    }

    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-08;
        relTol           1e-2;
    }

    p_rghFinal
    {
        $p;
        relTol 0;
    }
    pFinal
    {
        $p;
        relTol 0;
    }

    "(U|PV)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          1e-2;
    }

    "(U|PV)Final"
    {
        $U;
        relTol 0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  1;
    nCorrectors 3;
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    fields
    {
    }
    equations
    {
        ".*"    1;
    }
}


// ************************************************************************* //
