testCase/bunsenFlame/Allrun
#------------------------------------------------------------------------------

blockMesh

#fgmPremixedFoam >& log&

decomposePar
mpirun -np 4 fgmPremixedFoam -parallel >& log& 

#------------------------------------------------------------------------------
